<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"1067c2bf9840d6b0835919452f6e0735832c2c57bba1c55cf069dc655636987e","plan_job_ref":"Job Terraform Plan #568 at https://github.com/cal-itp/data-infra/actions/runs/18207670457","plan_out_hash":"03ae5acb31e739e513f35efec87596ce636a52408ef0b4fe7a27538626ec567a","plan_hash":"7bd6b25326d51037020f1e70458955dc6cca9503dec529f79bf4757f75b1f427","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/sentinel/us__
<details>
<summary>Plan: 8 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_iam_workload_identity_pool.sentinel-workload-identity-pool will be created
+   resource "google_iam_workload_identity_pool" "sentinel-workload-identity-pool" {
+       display_name              = "sentinel-workload-identity-pool"
+       id                        = (known after apply)
+       name                      = (known after apply)
+       project                   = "cal-itp-data-infra"
+       state                     = (known after apply)
+       workload_identity_pool_id = "********************************"
    }

  # google_iam_workload_identity_pool_provider.sentinel-workload-identity-pool-provider will be created
+   resource "google_iam_workload_identity_pool_provider" "sentinel-workload-identity-pool-provider" {
+       attribute_mapping                  = {
+           "google.subject" = "assertion.sub"
        }
+       id                                 = (known after apply)
+       name                               = (known after apply)
+       project                            = "cal-itp-data-infra"
+       state                              = (known after apply)
+       workload_identity_pool_id          = "********************************"
+       workload_identity_pool_provider_id = "**************************"

+       oidc {
+           allowed_audiences = [
+               "api://2041288c-b303-4ca0-9076-9612db3beeb2",
            ]
+           issuer_uri        = "https://sts.windows.net/33e01921-4d64-4f8c-a055-5bdaffd5e33d"
        }
    }

  # google_logging_project_sink.sentinel-sink will be created
+   resource "google_logging_project_sink" "sentinel-sink" {
+       destination            = "pubsub.googleapis.com/projects/cal-itp-data-infra/topics/sentinel-topic"
+       filter                 = "protoPayload.serviceName=iam.googleapis.com"
+       id                     = (known after apply)
+       name                   = "IAM-logs-sentinel-sink"
+       project                = "cal-itp-data-infra"
+       unique_writer_identity = true
+       writer_identity        = (known after apply)

+       bigquery_options (known after apply)
    }

  # google_project_iam_binding.log-writer will be created
+   resource "google_project_iam_binding" "log-writer" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       members = (known after apply)
+       project = "cal-itp-data-infra"
+       role    = "roles/pubsub.publisher"
    }

  # google_project_iam_custom_role.sentinel-custom-role will be created
+   resource "google_project_iam_custom_role" "sentinel-custom-role" {
+       deleted     = (known after apply)
+       description = "Role that allowes pulling messages from pub/sub"
+       id          = (known after apply)
+       name        = (known after apply)
+       permissions = [
+           "pubsub.subscriptions.consume",
+           "pubsub.subscriptions.get",
        ]
+       project     = "cal-itp-data-infra"
+       role_id     = "******************"
+       stage       = "GA"
+       title       = "Sentinel Custom Role"
    }

  # google_project_iam_member.bind-sentinel-custom-role-to-sentinel-service-account will be created
+   resource "google_project_iam_member" "bind-sentinel-custom-role-to-sentinel-service-account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:sentinel-service-account@cal-itp-data-infra.iam.gserviceaccount.com"
+       project = "cal-itp-data-infra"
+       role    = (known after apply)
    }

  # google_pubsub_subscription.sentinel-subscription will be created
+   resource "google_pubsub_subscription" "sentinel-subscription" {
+       ack_deadline_seconds       = (known after apply)
+       effective_labels           = {
+           "goog-terraform-provisioned" = "true"
        }
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "sentinel-subscription-IAMlogs"
+       project                    = "cal-itp-data-infra"
+       terraform_labels           = {
+           "goog-terraform-provisioned" = "true"
        }
+       topic                      = "sentinel-topic"

+       expiration_policy (known after apply)
    }

  # google_service_account_iam_binding.bind-workloadIdentityUser-role-to-sentinel-service-account will be created
+   resource "google_service_account_iam_binding" "bind-workloadIdentityUser-role-to-sentinel-service-account" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       members            = [
+           "principalSet://iam.googleapis.com/projects/1005246706141/locations/global/workloadIdentityPools/621b0a64174043cc8d884540d3487556/*",
        ]
+       role               = "roles/iam.workloadIdentityUser"
+       service_account_id = "***************************************************************************************************************"
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #568](https://github.com/cal-itp/data-infra/actions/runs/18207670457)